#include <iostream>
using namespace std;
#include "Logo.h"
#include "Fecha.h"
#include "Hora.h"
#include "facha.h"




void LogoConstante (){

Fecha fecha;
Hora hora;

rlutil::setColor(rlutil::YELLOW);
 rlutil::locate(2, 1);   cout<<"ÉÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ»";
 rlutil::locate(2, 2);   cout<<"                                                                º";
 rlutil::locate(2, 3);   cout<<"                                                                º";
rlutil::locate(2, 4);    cout<<"                                                                º";
rlutil::locate(2, 5);    cout<<"                                                                º";
rlutil::locate(2, 6);    cout<<"                                                                º";
rlutil::locate(2, 7);    cout<<"                                                                º";
rlutil::locate(2, 8);    cout<<"                                                                º";
rlutil::locate(2, 9);    cout<<"                                                                º";
rlutil::locate(2, 10);   cout<<"                                                                º";
rlutil::locate(2, 11);   cout<<"                                                                º";
rlutil::locate(2, 12);   cout<<"                                                                º";
rlutil::locate(2, 13);       cout<< "                                                                º";
 rlutil::locate(2, 14);      cout<< "                                                                º";
 rlutil::locate(2, 15);      cout<< "                                                                º";
 rlutil::locate(2, 16);      cout<< "ÈÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼";

  rlutil::locate(70, 6); cout << "--- Fecha: " <<fecha.toString()<<endl;
   rlutil::locate(70, 8);  cout << "--- Hora: " <<hora.toString()<<endl;





 rlutil::locate(11, 2); cout<< R"(
     ÛÛÛÛÛÛ»  ÛÛÛÛÛ» ÛÛÛÛÛÛ» ÛÛÛÛÛÛ» ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛ» ÛÛ» ÛÛÛÛÛ»
    ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÛÛ»ÛÛºÛÛÉÍÍÛÛ»
    ÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛºÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÉ¼ÛÛÛÛÛ»  ÛÛÛÛÛÛÉ¼ÛÛºÛÛÛÛÛÛÛº
    ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛºÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÉÍÍ¼  ÛÛÉÍÍÛÛ»ÛÛºÛÛÉÍÍÛÛº
    ÛÛÛÛÛÛÉ¼ÛÛº  ÛÛºÛÛº  ÛÛºÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛ»ÛÛº  ÛÛºÛÛºÛÛº  ÛÛº
    ÈÍÍÍÍÍ¼ ÈÍ¼  ÈÍ¼ÈÍ¼  ÈÍ¼ÈÍÍÍÍÍ¼ ÈÍÍÍÍÍÍ¼ÈÍ¼  ÈÍ¼ÈÍ¼ÈÍ¼  ÈÍ¼

           ÛÛÛÛÛÛ»  ÛÛÛÛÛ»  ÛÛÛÛÛÛ»ÛÛ»  ÛÛ»ÛÛÛÛÛÛÛ» ÛÛÛÛÛÛ» ÛÛÛÛÛÛ»
           ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÉÍÍÍÍ¼ÛÛº  ÛÛºÛÛÉÍÍÍÍ¼ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÍÛÛ»
           ÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛºÛÛº     ÛÛÛÛÛÛÛºÛÛÛÛÛ»  ÛÛº     ÛÛº   ÛÛº
           ÛÛÉÍÍÍ¼ ÛÛÉÍÍÛÛºÛÛº     ÛÛÉÍÍÛÛºÛÛÉÍÍ¼  ÛÛº     ÛÛº   ÛÛº
           ÛÛº     ÛÛº  ÛÛºÈÛÛÛÛÛÛ»ÛÛº  ÛÛºÛÛÛÛÛÛÛ»ÈÛÛÛÛÛÛ»ÈÛÛÛÛÛÛÉ¼
           ÈÍ¼     ÈÍ¼  ÈÍ¼ ÈÍÍÍÍÍ¼ÈÍ¼  ÈÍ¼ÈÍÍÍÍÍÍ¼ ÈÍÍÍÍÍ¼ ÈÍÍÍÍÍ¼
          )";
}

void LogoPrincipal () {

    rlutil::setColor(rlutil::YELLOW);
cout<< R"(
    ===================================================================================

  ÛÛÛÛÛÛ»  ÛÛÛÛÛ» ÛÛÛÛÛÛ» ÛÛÛÛÛÛ» ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛ» ÛÛ» ÛÛÛÛÛ»
  ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÛÛ»ÛÛºÛÛÉÍÍÛÛ»
  ÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛºÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÉ¼ÛÛÛÛÛ»  ÛÛÛÛÛÛÉ¼ÛÛºÛÛÛÛÛÛÛº
  ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛºÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÉÍÍ¼  ÛÛÉÍÍÛÛ»ÛÛºÛÛÉÍÍÛÛº
  ÛÛÛÛÛÛÉ¼ÛÛº  ÛÛºÛÛº  ÛÛºÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛ»ÛÛº  ÛÛºÛÛºÛÛº  ÛÛº
  ÈÍÍÍÍÍ¼ ÈÍ¼  ÈÍ¼ÈÍ¼  ÈÍ¼ÈÍÍÍÍÍ¼ ÈÍÍÍÍÍÍ¼ÈÍ¼  ÈÍ¼ÈÍ¼ÈÍ¼  ÈÍ¼

          ÛÛÛÛÛÛ»  ÛÛÛÛÛ»  ÛÛÛÛÛÛ»ÛÛ»  ÛÛ»ÛÛÛÛÛÛÛ» ÛÛÛÛÛÛ» ÛÛÛÛÛÛ»
          ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÉÍÍÍÍ¼ÛÛº  ÛÛºÛÛÉÍÍÍÍ¼ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÍÛÛ»
          ÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛºÛÛº     ÛÛÛÛÛÛÛºÛÛÛÛÛ»  ÛÛº     ÛÛº   ÛÛº
          ÛÛÉÍÍÍ¼ ÛÛÉÍÍÛÛºÛÛº     ÛÛÉÍÍÛÛºÛÛÉÍÍ¼  ÛÛº     ÛÛº   ÛÛº
          ÛÛº     ÛÛº  ÛÛºÈÛÛÛÛÛÛ»ÛÛº  ÛÛºÛÛÛÛÛÛÛ»ÈÛÛÛÛÛÛ»ÈÛÛÛÛÛÛÉ¼
          ÈÍ¼     ÈÍ¼  ÈÍ¼ ÈÍÍÍÍÍ¼ÈÍ¼  ÈÍ¼ÈÍÍÍÍÍÍ¼ ÈÍÍÍÍÍ¼ ÈÍÍÍÍÍ¼

                                     _        _
                                    \ \     / /
                                     \ \   / /
                                      \ \_/ /
                                       \   /
                                        ) (
                                       / _ \
                                      / / \ \
                                     /_/   \_\

      =================================================================================
    )"<<endl;

    rlutil::anykey("Cargando Sistema ...");// presiona una tecla para continuar
    system("cls"); // limpia pantalla ;
}
